import { describe, expect, test } from 'vitest'

import { ageToString } from '@/helpers/age-to-string'

describe('age-to-string', () => {
  const testCases: [number, string][] = [
    [0, '0 лет'],
    [1, '1 год'],
    [2, '2 года'],
    [3, '3 года'],
    [4, '4 года'],
    [5, '5 лет'],
    [10, '10 лет'],
    [11, '11 лет'],
    [12, '12 лет'],
    [20, '20 лет'],
    [21, '21 год'],
    [22, '22 года'],
    [23, '23 года'],
    [24, '24 года'],
    [25, '25 лет'],
    [30, '30 лет'],
    [31, '31 год'],
    [32, '32 года'],
    [33, '33 года'],
    [34, '34 года'],
    [35, '35 лет'],
    [40, '40 лет'],
    [41, '41 год'],
    [42, '42 года'],
    [43, '43 года'],
    [44, '44 года'],
    [45, '45 лет'],
    [50, '50 лет'],
    [51, '51 год'],
    [52, '52 года'],
    [53, '53 года'],
    [54, '54 года'],
    [55, '55 лет'],
    [60, '60 лет'],
    [61, '61 год'],
    [62, '62 года'],
    [63, '63 года'],
    [64, '64 года'],
    [65, '65 лет'],
    [70, '70 лет'],
    [71, '71 год'],
    [72, '72 года'],
    [73, '73 года'],
    [74, '74 года'],
    [75, '75 лет'],
    [80, '80 лет'],
    [81, '81 год'],
    [82, '82 года'],
    [83, '83 года'],
    [84, '84 года'],
    [85, '85 лет'],
    [90, '90 лет'],
    [91, '91 год'],
    [92, '92 года'],
    [93, '93 года'],
    [94, '94 года'],
    [95, '95 лет'],
    [100, '100 лет']
  ]

  testCases.forEach(([age, expectedString]) => {
    test(`Should return "${expectedString}" for age ${age}`, () => {
      expect(ageToString(age)).toBe(expectedString)
    })
  })
})
